# 算术运算符、比较运算符、位运算符、逻辑算符、成员运算符、身份运算符、三目算符
'''
1.算术运算符（7个）
    +（加） -（减） *（乘） /（除） %（取余） //（整除） **（幂）

2.比较运算符（7个）
    ==（相等） !=（不等） <>（不等） >（大于） <（小于） >=（大于或等于） <=（小于或等于）
    
3.赋值运算符（4个）
    =（直接赋值） +=（加运算后赋值） -=（减运算后赋值） *=（乘运算后赋值） /=（） **=（） //=（） %=（）
    
4.位运算符（6个）
    & | ^ ~ << >>
    
5.逻辑运算符（3个）
    and（与） or（或） not（非）
    
6.成员运算符（4个）
    in 和 not in
    is 和 is not
    
7.三目运算符（1个）
    为真时的结果 if 判定条件 else 为假时的结果
'''
# 1.算术运算符：+-*/  % // **
print(12 % 5)
print(12 // 5)
print(2 ** 5)

# 2.比较运算符：> < >= <= == !=
# 返回布尔值

# 3.赋值运算符

# 4.逻辑运算符

# 5.成员运算符

# 6.三目运算符
